{
  "architectures": [
    "LlavaAnythingForConditionalGeneration"
  ],
  "hidden_size": 4096,
  "image_seq_length": 576,
  "image_token": "<image>",
  "image_token_index": 151669,
  "model_type": "llava_anything",
  "num_additional_image_tokens": 1,
  "projector_hidden_act": "gelu",
  "projector_type": "mlp2x_gelu",
  "text_config": {
    "_name_or_path": "Qwen/Qwen3-8B",
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "layer_types": [
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 40960,
    "max_window_layers": 36,
    "model_type": "qwen3",
    "num_attention_heads": 32,
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "pad_token_id": null,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 1000000,
      "rope_type": "default"
    },
    "sliding_window": null,
    "tie_word_embeddings": false,
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936
  },
  "text_model_name_or_path": "Qwen/Qwen3-8B",
  "text_trust_remote_code": false,
  "transformers_version": "5.8.1",
  "trust_remote_code": false,
  "vision_config": {
    "add_cross_attention": false,
    "attention_dropout": 0.0,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.0,
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "quick_gelu",
    "hidden_size": 1024,
    "image_size": 336,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_decoder": false,
    "layer_norm_eps": 1e-05,
    "model_type": "clip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "pad_token_id": null,
    "patch_size": 14,
    "prefix": null,
    "projection_dim": 768,
    "pruned_heads": {},
    "sep_token_id": null,
    "task_specific_params": null,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "torchscript": false,
    "use_bfloat16": false
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "default",
  "vision_model_name_or_path": "openai/clip-vit-large-patch14-336",
  "vision_trust_remote_code": false,
  "vocab_size": 151936
}
