{
  "architectures": [
    "LlavaAnythingForConditionalGeneration"
  ],
  "hidden_size": 4096,
  "image_seq_length": 729,
  "image_token": "<image>",
  "image_token_index": 131072,
  "model_type": "llava_anything",
  "num_additional_image_tokens": 0,
  "projector_hidden_act": "gelu",
  "projector_type": "mlp2x_gelu",
  "text_config": {
    "_name_or_path": "swiss-ai/Apertus-8B-Instruct-2509",
    "architectures": [
      "ApertusForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "dtype": "bfloat16",
    "eos_token_id": 68,
    "hidden_act": "xielu",
    "hidden_dropout": 0.0,
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 21504,
    "max_position_embeddings": 65536,
    "mlp_bias": false,
    "model_type": "apertus",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pad_token_id": 3,
    "post_norm": false,
    "qk_norm": true,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "factor": 8.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_theta": 12000000,
      "rope_type": "llama3",
      "type": "llama3"
    },
    "tie_word_embeddings": false,
    "use_cache": false,
    "vocab_size": 131072
  },
  "text_model_name_or_path": "swiss-ai/Apertus-8B-Instruct-2509",
  "text_trust_remote_code": false,
  "transformers_version": "5.8.1",
  "trust_remote_code": false,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 384,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "patch_size": 14
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "full",
  "vision_model_name_or_path": "google/siglip-so400m-patch14-384",
  "vision_trust_remote_code": false,
  "vocab_size": 131072
}
