{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|assistant_end|>",
  "extra_special_tokens": [
    "<image>"
  ],
  "is_local": false,
  "local_files_only": false,
  "model_input_names": [
    "input_ids",
    "attention_mask"
  ],
  "model_max_length": 1024,
  "pad_token": "<pad>",
  "padding_side": "left",
  "processor_class": "LlavaAnythingProcessor",
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "<unk>"
}
